package main

import "fmt"

func main() {
	// 除法 / ，整数相除，向下取整
	fmt.Println(10 / 4) // = 2

	// 除法 / ，有浮点数参与运算，则保留小数
	fmt.Println(10.0 / 4) // =2.5

	// 取模（取余）运算，是保留了余数
	// 运算公式： a % b = a - a / b * b
	fmt.Println(" 10 除 3 余", 10%3)     // 10 % 3 = 10 - 10 / 3 * 3 = 10 - 3 * 3 = 10 - 9 = 1
	fmt.Println(" -10 除 3 余", -10%3)   // -10 % 3 = -10 - (-10) / 3 * 3 = -10 - (-3) * 3  = -10 + 9 = -1
	fmt.Println(" 10 除 -3 余", 10%-3)   // 10 %  -3 = 10 - 10 / (-3) * (-3) = 10 - (-3) * (-3) = 10 - 9 = 1
	fmt.Println(" -10 除 -3 余", -10%-3) // -10 % -3 = -10 - (-10) / (-3) * (-3) = -10 - 3 * (-3) = -10 + 9 = -1

	// ++ 和 -- 的使用
	i := 10
	i++ // i = i + 1
	// a := i++ 或者 b := i-- 都不行，不可以直接赋值给变量
	fmt.Println("i =", i)
	i-- // i = i - 1
	fmt.Println("i =", i)

	// 练习题
	// 假设还有 97 天放假，求出还有几个星期零几天
	fmt.Printf("还有 %v 个星期，零 %v 天放假\n", 97/7, 97%7)

	// 定义变量保存华氏温度，华氏温度转摄氏温度公式： 摄氏温度 = 5/9*（华氏温度 - 100） ，求摄氏温度
	var Fahrenheit float32 = 134.2
	fmt.Printf("Centigrade is %v\n", 5.0/9*(Fahrenheit-100))
}
